# 11. 데이터 분석을 위한 패키지

## 2) 구조적 데이터 표시와 처리에 강한 pandas

## 구조적 데이터 생성하기

### Series를 활용한 데이터 생성

In [1]:
import pandas as pd
import numpy as np

In [4]:
# s = pd.Series(seq_data)
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
type(s1)

pandas.core.series.Series

In [6]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [7]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [8]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [11]:
s2.values.dtype

dtype('O')

In [12]:
import numpy as np

s3 = pd.Series([np.nan, 10, 30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [15]:
# s = pd.Series(seq_data, index = index_seq)
index_date = ['2018-10-07', '2018-10-08', '2018-10-09', '2018-10-10']
s4 = pd.Series([200, 195, np.nan, 205], index = index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [17]:
# s = pd.Series(dict_data)
# key값이 인덱스로, value가 value로
s5 = pd.Series({'국어': 100, '영어': 85, '수학': 90})
s5

국어    100
영어     85
수학     90
dtype: int64

### 날짜 자동 생성: data_range

In [19]:
# pd.date_range(start = None, end = None, periods = None, freq = 'D')
# 모두 default parameter 를 갖고 있다. end와 epriods는 배타적 관계. 둘 중 1개만 씀
pd.date_range(start = '2019-01-01', end = '2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [20]:
pd.date_range(start = '2019.01.01', end = '2019/01/07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [21]:
# 날짜 데이터의 형식 yyyy-mm-dd, yyyy.mm.dd, yyyy/mm/dd, mm-dd-yyyy, mm.dd.yyyy, mm/dd/yyyy
# 하지만 생성된 날짜 데이터는 모두 yyyy-mm-dd
pd.date_range(start = '01-01-2019', end = '01.07.2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [22]:
pd.date_range(start = '2019-01-01', periods = 7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [24]:
pd.date_range(start = '2019-01-01', periods = 4, freq = '2D') # 이틀

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

In [26]:
pd.date_range(start = '2019-01-01', periods = 4, freq = 'W') # 일주일

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

In [ ]:
pd.date_range(start = '2019-01-01', periods = 4, freq = 'W')

In [27]:
pd.date_range(start = '2019-01-01', periods = 12, freq = '2BM') # 2개월 주기 업무 월말 날자 기준

DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-29', '2020-01-31', '2020-03-31',
               '2020-05-29', '2020-07-31', '2020-09-30', '2020-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [28]:
pd.date_range(start = '2019-01-01', periods = 4, freq = 'QS') # 분기 시작 날짜 기준

DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [30]:
date_lst = ['2020-06-20', '2020-06-21', '2020-06-22', '2020-06-23', '2020-06-23']
dt = pd.to_datetime(date_lst)
pd.Series([51, 62, 55, 48, 58], index = dt)

2020-06-20    51
2020-06-21    62
2020-06-22    55
2020-06-23    48
2020-06-23    58
dtype: int64

### DataFrame을 활용한 데이터 생성

In [88]:
# df = pd.DataFrame(data [, index = index_data, columns = columns_data])
# 행 단위로 만들어짐. 하지만 df는 열단위로 읽기 때문에 데이터를 읽는 데 문제가 생길 수 있다.
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
data_list = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [35]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
index_date = pd.date_range(start='2020-01-01', periods=4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index = index_date, columns = columns_list)

             A   B   C
2020-01-01   1   2   3
2020-01-02   4   5   6
2020-01-03   7   8   9
2020-01-04  10  11  12

In [38]:
table_data = {'연도': [2015, 2016, 2017, 2018, 2019],
             '지사': ['한국', '미국', '영국', '일본', '중국'],
             '고객 수': [500, 200, 300, 100, 100]}
table_data

{'연도': [2015, 2016, 2017, 2018, 2019],
 '지사': ['한국', '미국', '영국', '일본', '중국'],
 '고객 수': [500, 200, 300, 100, 100]}

In [39]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   500
1  2016  미국   200
2  2017  영국   300
3  2018  일본   100
4  2019  중국   100

In [43]:
df = pd.DataFrame(table_data, columns = ['연도', '지사', '고객 수'])
df

     연도  지사  고객 수
0  2015  한국   500
1  2016  미국   200
2  2017  영국   300
3  2018  일본   100
4  2019  중국   100

In [44]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [45]:
df.values

array([[2015, '한국', 500],
       [2016, '미국', 200],
       [2017, '영국', 300],
       [2018, '일본', 100],
       [2019, '중국', 100]], dtype=object)

In [46]:
df.columns

Index(['연도', '지사', '고객 수'], dtype='object')

## 데이터 연산

In [51]:
aaa = pd.Series(['a', 'b', 'c', '1', '2', '3'])
aaa

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [97]:
df = pd.DataFrame()
df['A'] = [1, 2, 3]
df['B'] = [4, 5, 6]
df['C'] = pd.Series([7, 8, 9])

print(df, '\n')
print(df.dtypes, '\n')
print(df['A'].dtype, '\n')
print(type(df['A']), '\n')

   A  B
0  1  4
1  2  5
2  3  6

A    int64
B    int64
dtype: object

int64

<class 'pandas.core.series.Series'>

In [65]:
arr = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
arr = arr.transpose() # 전치행렬
df = pd.DataFrame(arr)
df

    0   1   2
0  10  40  70
1  20  50  80
2  30  60  90

### 데이터 연산

In [66]:
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series([6, 7, 8, 9, 10])
s1 + s2

0    16
1    27
2    38
3    49
4    60
dtype: int64

In [68]:
s1 - s2

0     4
1    13
2    22
3    31
4    40
dtype: int64

In [69]:
s1 * s2

0     60
1    140
2    240
3    360
4    500
dtype: int64

In [70]:
s1 / s2

0    1.666667
1    2.857143
2    3.750000
3    4.444444
4    5.000000
dtype: float64

In [71]:
# pandas의 데이터끼리는 서로 크기가 달라도 연산할 수 있음.
s3 = pd.Series([1, 2, 3, 4])
s4 = pd.Series([10, 20, 30, 40, 50])

# 연산을 할 수 있는 항목만 연산 수행
s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [72]:
s4 - s3

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

In [73]:
s3 * s4

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [74]:
s3 / s4

0    0.1
1    0.1
2    0.1
3    0.1
4    NaN
dtype: float64

In [79]:
table_data1 = {'A': [1, 2, 3, 4, 5],
             'B': [10, 20, 30, 40, 50],
             'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [80]:
table_data2 = {'A': [6, 7, 8],
             'B': [60, 70, 80],
             'C': [600, 700, 800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [81]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [8]:
# [10, 20, 30] - [1, 2]

In [12]:
table_data3 = {'봄': [256.5, 264.3, 215.9, 223.2, 312.8],
               '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
               '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
               '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = [2012, 2013, 2014, 2015, 2016]

df3 = pd.DataFrame(table_data3, index = index_list, columns = columns_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [13]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [14]:
df3.mean(axis = 1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [16]:
df3.std() # 열 기준 표준편차

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [17]:
df3.std(axis = 1) # 행 기준 표준편차

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [21]:
df3.describe() # axis 지정 못함

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [22]:
df3.T.describe() # 전치로 행별 describe

             2012        2013        2014       2015        2016
count    4.000000    4.000000    4.000000    4.00000    4.000000
mean   382.475000  280.725000  296.425000  241.77500  312.175000
std    274.472128  211.128782  221.150739  114.16676  146.548658
min    139.300000   59.900000   76.900000  109.10000  108.100000
25%    227.200000  188.375000  181.150000  194.67500  261.625000
50%    310.000000  247.750000  254.500000  235.45000  347.200000
75%    465.275000  340.100000  369.775000  282.55000  397.750000
max    770.600000  567.500000  599.800000  387.10000  446.200000

## 데이터를 원하는 대로 선택하기

In [3]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
           '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
           '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
           '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
           '동해선 KTX': [np.nan, np.nan, np.nan, np.nan, 2395, 3789, 6667]}
col_list = ['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, index = index_list, columns = col_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3789.0
2017    32427     9228     5570     5766   6667.0

In [4]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [5]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [6]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3789.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [7]:
df_KTX.head(6) # 인자 지정하지 않으면 default 5

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3789.0

In [8]:
df_KTX.tail(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3789.0
2017    32427     9228     5570     5766   6667.0

In [9]:
# DataFrame_data[행_시작_위치:행_끝_위치]
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [10]:
df_KTX[3:5] # 인덱스 번호 지정 시 행 끝 위치 미포함

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [11]:
# DataFrame_data.loc[index_name]
df_KTX.loc['2014']

경부선 KTX    43621.0
호남선 KTX     6626.0
경전선 KTX     4424.0
전라선 KTX     2244.0
동해선 KTX        NaN
Name: 2014, dtype: float64

In [15]:
df_KTX.loc['2011':'2014'] # 인덱스명을 직접 지정하는 경우 마지막 포함

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN

In [16]:
# DataFrame_data[column_name]
df_KTX['경부선 KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

In [18]:
# DataFrame_data[column_name][start_index_name:end_index_name]
df_KTX['경전선 KTX']['2011':'2014']

2011    3627
2012    4168
2013    4088
2014    4424
Name: 경전선 KTX, dtype: int64

In [19]:
# DataFrame_data[column_name][start_index_pos:end_index_pos]
df_KTX['경전선 KTX'][2:5]

2013    4088
2014    4424
2015    4606
Name: 경전선 KTX, dtype: int64

In [ ]:
# 하나의 원소만 선택하기
# DataFrame_data.loc[index_name][column_name]
# DataFrame_data.loc[index_name, column_name]
# # DataFrame_data[column_name][index_name]
# DataFrame_data[column_name][index_pos]
# DataFrame_data[column_name].loc[index_name]

In [20]:
df_KTX.loc['2016']['호남선 KTX']

10622.0

In [22]:
df_KTX.loc['2015', '호남선 KTX']

8675

In [23]:
df_KTX['경전선 KTX']['2014']

4424

In [25]:
df_KTX['호남선 KTX'][1]

6967

In [27]:
df_KTX['동해선 KTX'].loc['2016']

3789.0

In [12]:
df_KTX[['경부선 KTX', '호남선 KTX']]['2013':'2016']

      경부선 KTX  호남선 KTX
2013    42005     6873
2014    43621     6626
2015    41702     8675
2016    41266    10622

In [13]:
df_KTX[['경부선 KTX', '호남선 KTX']][2:6]

      경부선 KTX  호남선 KTX
2013    42005     6873
2014    43621     6626
2015    41702     8675
2016    41266    10622

In [16]:
# df_KTX[['경부선 KTX', '호남선 KTX']]['2013']
df_KTX[['경부선 KTX', '호남선 KTX']]['2013':'2013'] # 반드시 범위로 지정을 해줘야 한다.

      경부선 KTX  호남선 KTX
2013    42005     6873

## 데이터 통합하기

### 세로 방향으로 통합하기

In [46]:
# DataFrame_data1.append(DataFrame_data2 [,ignore_inex=True])
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                   'Class2': [91, 93, 97, 99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [48]:
df2 = pd.DataFrame({'Class1': [87, 89],
                          'Class2': [85, 90]}) 
df2

   Class1  Class2
0      87      85
1      89      90

In [49]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [51]:
df1.append(df2, ignore_index = True) # 새로운 df

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [52]:
df3 = pd.DataFrame({'Class1': [96, 83]})
df3

   Class1
0      96
1      83

In [53]:
df2.append(df3, ignore_index = True) # 새로운 df

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

### 가로 방향으로 통합하기

In [54]:
# index가 같은 두 데이터 프레임 데이터. 공통 속성 없이 합쳐져 새로운 df
# DataFrame_data1.join(DataFrame_data2)
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [55]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [105]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index = index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index = index_label)

df1a.join(df4a)
# df1a.join(df4a, how = 'outer')

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [107]:
class3 = df4a['Class3']
type(class3)

pandas.core.series.Series

In [58]:
# index_label = ['a', 'b', 'c', 'd']
# df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
#                     'Class2': [91, 93, 97, 99]}, index = index_label)
# df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index = list('1234'))
                     
# df1a.join(df4a) # index가 달라도 join은 되지만 제대로 통합되지 않는다.

   Class1  Class2  Class3
a      95      91     NaN
b      92      93     NaN
c      98      97     NaN
d     100      99     NaN

In [65]:
df5 = pd.DataFrame({'Class4': [82, 92]}, index = list('ab'))
df5

   Class4
a      82
b      92

In [66]:
new_df = df1a.join(df4a)
new_df.join(df5)

   Class1  Class2  Class3  Class4
a      95      91      93    82.0
b      92      93      91    92.0
c      98      97      95     NaN
d     100      99      98     NaN

### 특정 열을 기준으로 통합하기

In [67]:
# DataFrame_left_data.merge(DataFrame_right_data)
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [68]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [69]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [94]:
df_left = pd.DataFrame({'key': ['A', 'B', 'C'],
                       'left': [1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [95]:
df_right = pd.DataFrame({'key': ['A', 'B', 'D'],
                       'right': [4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [96]:
df_left.merge(df_right, how = 'left')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [97]:
df_left.merge(df_right, how = 'right')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [98]:
df_left.merge(df_right, how = 'outer')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [99]:
df_left.merge(df_right, how = 'inner', on = 'key')

  key  left  right
0   A     1      4
1   B     2      5

## 데이터 파일을 읽고 쓰기

### 표 형식의 데이터 파일을 읽기

In [17]:
%%writefile C:\BigData\projects\myPyCode\data\sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Overwriting C:\BigData\projects\myPyCode\data\sea_rain1.csv

In [23]:
pd.read_csv('C:\BigData\projects\myPyCode\data\sea_rain1.csv')

       연도       동해       남해       서해       전체
0    1996  17.4629  17.2288  14.4360  15.9067
1    1997  17.4116  17.4092  14.8248  16.1526
2    1998  17.5944  18.0110  15.2512  16.6044
3    1999  18.1495  18.3175  14.8979  16.6284
4    2000  17.9288  18.1766  15.0504  16.6178

In [24]:
pd.read_csv('C:\BigData\projects\myPyCode\data\sea_rain1_from_notepad.csv', encoding = 'cp949')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [25]:
pd.read_csv('C:\BigData\projects\myPyCode\data\sea_rain1_space.txt', sep = ' ')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [27]:
pd.read_csv('C:\BigData\projects\myPyCode\data\sea_rain1.csv', index_col = '연도')

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

### 표 형식의 데이터를 파일로 쓰기

In [120]:
df_WH = pd.DataFrame({'Weight': [62, 67, 55, 74],
                     'Height': [165, 177, 160, 180]},
                    index = ['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [121]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [122]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [123]:
df_WH.to_csv('C:\BigData\projects\myPyCode\data/save_DataFrame.csv')

In [ ]:
# df_WH.to_csv('C:\BigData\projects\myPyCode\data/save_DataFrame.csv', encoding = 'cp949')

In [124]:
!type C:\BigData\projects\myPyCode\data\save_DataFrame.csv # cmd에서는 cp949로 읽어야 한글이 깨지지 않음.

User,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [125]:
df_pr = pd.DataFrame({'판매가격': [2000, 3000, 5000, 10000],
                     '판매량': [32, 53, 40, 25]},
                    index = ['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [126]:
file_name = 'C:\BigData\projects\myPyCode\data\save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep = ' ', encoding = 'cp949')

In [128]:
!type C:\BigData\projects\myPyCode\data\save_DataFrame_cp949.txt

제품번호 판매가격 판매량
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25